################################################################################
#   name
#     Purpose
#
#   xx.xx.2014   ZT
################################################################################
puts "ZT"

data = []
#row[1] = []
data[1] = [["Функциональные", "Товар, гамма", "Я знаю товар своего отдела и его расположение. Я прошел обучения по ОЗТ", true, false, "", "", "", "", "", "", "", "", ""], ["Функциональные", "Товар, гамма", "Я знаю товар ЛЦ, Бестселлер, 20/80, СТМ и AVS отдела, товары интернет-магазина", false, false, "", "", "", "", "", "", "", "", ""], ["Функциональные", "Товар, гамма", "Я знаю, как использовать товар", false, false, "", "", "", "", "", "", "", "", ""], ["Функциональные", "Товар, гамма", "Я выкладываю товар, соблюдая правила охраны труда-заполняю полки", false, false, "", "", "", "", "", "", "", "", ""], ["Функциональные", "Товар, гамма", "Я бережно отношусь к товару; снижаю потери", false, false, "", "", "", "", "", "", "", "", ""], ["Функциональные", "Товар, гамма", "Я знаю, где какой товар представлен, могу проверить по компьютеру наличие товара и дату поставки", false, false, "", "", "", "", "", "", "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "Я знаю характеристики товара всего отдела и могу проконсультировать своих клиентов по установке товара. Я прошел обучения Мастер классы школы ремонта, ОЗТ 2 уровень", true, false, "", "", "", "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "Я знаю товары Гаммы А и Гаммы Б своего отдела", false, false, "", "", "", "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "Я знаю сопутствующий товар к основному товару", false, false, "", "", "", "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "Я тестирую все товары отдела по плану Школы ремонта", false, false, "", "", "", "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "Я знаю и анализирую уровень продаж своих товаров  в зоне своей ответственности (аллея, ТЖ, грилли...)", false, false, "", "", "", "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "", "", "", "Я предлагаю товар соотвествующий уровню потребностей моих клиентов (из соотвестующего ценового сегмента)", true, false, "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "", "", "", "Я предлагаю кросс продажу", false, false, "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "", "", "", "Я предлагаю товар для ТЖ", false, false, "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "", "", "", "Я участвую в выборе товара для ТЖ", false, false, "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "", "", "", "Я предлагаю план по изменению линейных метров", false, false, "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "", "", "", "Я передаю свои знания и опыт по товару", false, false, "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "", "", "", "Я могу принимать участие в рабочих группах по созданию коллекций (я передаю потребности клиентов,качество товаров,качество и размер упаковки,сервис поставщика)", false, false, "", "", ""], ["Функциональные", "Товар, гамма", "", "", "", "", "", "", "", "", "", "Я знаю конкурентов, знаю чем их гамма отличается от моей", true, false], ["Функциональные", "Товар, гамма", "", "", "", "", "", "", "", "", "", "Я предлагаю товар с лучшими показателями продаж для участия в PAC отдела", false, false], ["Функциональные", "Товар, гамма", "", "", "", "", "", "", "", "", "", "Я наставник по товару для стажеров отдела", false, false], ["Функциональные", "Товар, гамма", "", "", "", "", "", "", "", "", "", "Я знаю и соблюдаю правила ВУППС", false, false]]

#puts row[1].inspect
data[1].each do |rr|
#  puts "count="+rr.count.to_s
#  puts "0: "+rr[0].to_s
#  puts "1: "+rr[1].to_s
#  puts "2: "+rr[2].to_s
#  puts "3: "+rr[3].to_s
#  puts "4: "+rr[4].to_s
#  puts "5: "+rr[5].to_s
#  puts "6: "+rr[6].to_s
#  puts "7: "+rr[7].to_s
#  puts "8: "+rr[8].to_s
#  puts "8: "+rr[9].to_s
#  puts "10: "+rr[10].to_s
#  puts "11: "+rr[11].to_s
#  puts "12: "+rr[11].to_s
#  puts "13: "+rr[13].to_s
end

#data[1].each do |rr|
#  rr.each do |rrr|
#    puts rrr.class.to_s
#  end
#end

#matrix = Array.new(7)
#for k in 0..6
#  matrix[k] =Array.new(14, '')
#end

h = []
x = []
y = []
z = []
u = []

i=0
j=0
k=0
n=0

data[1].each do |r|
  h[0] = r[0]
  h[1] = r[1]
  if r[2] != ''
    x[i] = Array.new(3,'')
    x[i][1] = r[2]
    x[i][2] = r[3]
    x[i][3] = r[4]
    i += 1
  elsif r[5] != ''
    y[j] = Array.new(3,'')
    y[j][1] = r[5]
    y[j][2] = r[6]
    y[j][3] = r[7]
    j += 1
  elsif r[8] != ''
    z[k] = Array.new(3,'')
    z[k][1] = r[8]
    z[k][2] = r[9]
    z[k][3] = r[10]
    k += 1
  else
    u[n] = Array.new(3,'')
    u[n][1] = r[11]
    u[n][2] = r[12]
    u[n][3] = r[13]
    n += 1
  end
end

max = [x.count, y.count, z.count, u.count].max
puts max.to_s

#puts "x: "
#puts x.inspect
#
#x.each do |xx|
#  puts xx.inspect
#end
#puts "++++++++++++++++++"
#x.each do |xx|
#  xx.each do |xxx|
#   puts xxx.inspect
#  end
#end
#
#puts "---------"
#x.each do |xx|
#  puts "1: "+xx[1].to_s
#  puts "2: "+xx[2].to_s
#  puts "3: "+xx[3].to_s
#end

#puts "y: "
#puts y.inspect
#
#puts "z: "
#puts z.inspect
#
#puts "u: "
#puts u.inspect

matrix = Array.new(max)

for m in 1..max
  matrix[m] = Array.new(14, '')
  matrix[m][0] = h[0]
  matrix[m][1] = h[1]
end

#puts "m: "
#puts matrix.inspect

m = 1
x.each do |xx|
  matrix[m][2] = xx[1]
  matrix[m][3] = xx[2]
  matrix[m][4] = xx[3]
  m += 1
end

#puts "m-x: "
#puts matrix.inspect

m = 1
y.each do |yy|
  matrix[m][5] = yy[1]
  matrix[m][6] = yy[2]
  matrix[m][7] = yy[3]
  m += 1
end

m = 1
z.each do |zz|
  matrix[m][8]  = zz[1]
  matrix[m][9]  = zz[2]
  matrix[m][10] = zz[3]
  m += 1
end

m = 1
u.each do |uu|
  matrix[m][11] = uu[1]
  matrix[m][12] = uu[2]
  matrix[m][13] = uu[3]
  m += 1
end

matrix.each do |m|
  if !m.nil?
    puts m[1].inspect
  end
end

#puts matrix.count.to_s

